## Plan Result (demo_backendappgateway)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw"
        name                              = "cft-aks01-demo-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/et-pet-api-base" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "et-pet-api-base" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/et-pet-ccd-export-base" -> null
          - ip_addresses = [
              - "10.50.79.221",
              - "10.50.95.221",
            ] -> null
          - name         = "et-pet-ccd-export-base" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.221",
              + "10.50.95.221",
            ]
          + name         = "et-pet-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.50.79.221",
              + "10.50.95.221",
            ]
          + name         = "et-pet-ccd-export"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/aac-ac-int-manage-case-assignment" -> null
          - name                                = "aac-ac-int-manage-case-assignment" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/aac-ac-int-manage-case-assignment" -> null
          - probe_name                          = "aac-ac-int-manage-case-assignment" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - name                                = "adoption-cos-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/adoption-cos-api" -> null
          - probe_name                          = "adoption-cos-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/bar-api-int" -> null
          - name                                = "bar-api-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/bar-api-int" -> null
          - probe_name                          = "bar-api-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccd-ac-int-data-store-api" -> null
          - name                                = "ccd-ac-int-data-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccd-ac-int-data-store-api" -> null
          - probe_name                          = "ccd-ac-int-data-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccd-ac-int-definition-store-api" -> null
          - name                                = "ccd-ac-int-definition-store-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccd-ac-int-definition-store-api" -> null
          - probe_name                          = "ccd-ac-int-definition-store-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccd-admin-ccd-int" -> null
          - name                                = "ccd-admin-ccd-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccd-admin-ccd-int" -> null
          - probe_name                          = "ccd-admin-ccd-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccd-admin-web" -> null
          - name                                = "ccd-admin-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccd-admin-web" -> null
          - probe_name                          = "ccd-admin-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccd-test-stubs-service" -> null
          - name                                = "ccd-test-stubs-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccd-test-stubs-service" -> null
          - probe_name                          = "ccd-test-stubs-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccpay-bulkscanning-api-int" -> null
          - name                                = "ccpay-bulkscanning-api-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccpay-bulkscanning-api-int" -> null
          - probe_name                          = "ccpay-bulkscanning-api-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccpay-notifications-service" -> null
          - name                                = "ccpay-notifications-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccpay-notifications-service" -> null
          - probe_name                          = "ccpay-notifications-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccpay-notifications-service-int" -> null
          - name                                = "ccpay-notifications-service-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccpay-notifications-service-int" -> null
          - probe_name                          = "ccpay-notifications-service-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ccpay-refunds-api-int" -> null
          - name                                = "ccpay-refunds-api-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/ccpay-refunds-api-int" -> null
          - probe_name                          = "ccpay-refunds-api-int" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/civil-sdt" -> null
          - name                                = "civil-sdt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/civil-sdt" -> null
          - probe_name                          = "civil-sdt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/civil-sdt-commissioning" -> null
          - name                                = "civil-sdt-commissioning" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/civil-sdt-commissioning" -> null
          - probe_name                          = "civil-sdt-commissioning" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/civil-sdt-gateway" -> null
          - name                                = "civil-sdt-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/probes/civil-sdt-gateway" -> null
          - probe_name                          = "civil-sdt-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/dm-store-ccd-int" -> null
          - name                                = "dm-store-ccd-int" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id   

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

Collection/rd-judicial-data-load"
          + backend_http_settings_name = "rd-judicial-data-load"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-judicial-data-load"
          + http_listener_name         = "rd-judicial-data-load"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-judicial-data-load"
          + name                       = "rd-judicial-data-load"
          + priority                   = 250
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-location-ref-api"
          + backend_address_pool_name  = "rd-location-ref-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-location-ref-api"
          + backend_http_settings_name = "rd-location-ref-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-location-ref-api"
          + http_listener_name         = "rd-location-ref-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-location-ref-api"
          + name                       = "rd-location-ref-api"
          + priority                   = 260
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-location-ref-api-int"
          + backend_address_pool_name  = "rd-location-ref-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-location-ref-api-int"
          + backend_http_settings_name = "rd-location-ref-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-location-ref-api-int"
          + http_listener_name         = "rd-location-ref-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-location-ref-api-int"
          + name                       = "rd-location-ref-api-int"
          + priority                   = 320
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-professional-api"
          + backend_address_pool_name  = "rd-professional-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-professional-api"
          + backend_http_settings_name = "rd-professional-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-professional-api"
          + http_listener_name         = "rd-professional-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-professional-api"
          + name                       = "rd-professional-api"
          + priority                   = 200
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-professional-api-int"
          + backend_address_pool_name  = "rd-professional-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-professional-api-int"
          + backend_http_settings_name = "rd-professional-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-professional-api-int"
          + http_listener_name         = "rd-professional-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-professional-api-int"
          + name                       = "rd-professional-api-int"
          + priority                   = 270
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-profile-sync"
          + backend_address_pool_name  = "rd-profile-sync"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync"
          + backend_http_settings_name = "rd-profile-sync"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-profile-sync"
          + http_listener_name         = "rd-profile-sync"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-profile-sync"
          + name                       = "rd-profile-sync"
          + priority                   = 220
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-profile-sync-int"
          + backend_address_pool_name  = "rd-profile-sync-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync-int"
          + backend_http_settings_name = "rd-profile-sync-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-profile-sync-int"
          + http_listener_name         = "rd-profile-sync-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-profile-sync-int"
          + name                       = "rd-profile-sync-int"
          + priority                   = 280
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api"
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api"
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api"
          + http_listener_name         = "rd-user-profile-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api"
          + name                       = "rd-user-profile-api"
          + priority                   = 210
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api-int"
          + backend_address_pool_name  = "rd-user-profile-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api-int"
          + backend_http_settings_name = "rd-user-profile-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api-int"
          + http_listener_name         = "rd-user-profile-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api-int"
          + name                       = "rd-user-profile-api-int"
          + priority                   = 290
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rpts-api"
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rpts-api"
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rpts-api"
          + http_listener_name         = "rpts-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rpts-api"
          + name                       = "rpts-api"
          + priority                   = 520
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-case-api"
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sptribs-case-api"
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sptribs-case-api"
          + http_listener_name         = "sptribs-case-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sptribs-case-api"
          + name                       = "sptribs-case-api"
          + priority                   = 510
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + priority                   = 370
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + priority                   = 440
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet-api"
          + id                         = (known after apply)
          + name                       = "et-pet-api"
          + priority                   = 610
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet-ccd-export"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet-ccd-export"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet-ccd-export"
          + id                         = (known after apply)
          + name                       = "et-pet-ccd-export"
          + priority                   = 620
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (70 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1716,"Program":"tfcmt","SHA1":"","Target":"demo_backendappgateway","Vars":{}} -->